dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/main.c
/*******************************************************************************
* File Name: main.c
*
* Description: This is the main application file which initializes the BSP,
* LPTimer, RTC and creates an HTTPS Client task and starts the RTOS scheduler.
*
* Related Document: See README.md
*
********************************************************************************
* (c) 2024-2025, Infineon Technologies AG, or an affiliate of Infineon Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is owned by
* Infineon Technologies AG or one of its affiliates ("Infineon") and is protected
* by and subject to worldwide patent protection, worldwide copyright laws, and
* international treaty provisions. Therefore, you may use this Software only as
* provided in the license agreement accompanying the software package from which
* you obtained this Software. If no license agreement applies, then any use,
* reproduction, modification, translation, or compilation of this Software is
* prohibited without the express written permission of Infineon.
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
* BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF THIRD-PARTY RIGHTS AND
* IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A SPECIFIC USE/PURPOSE OR
* MERCHANTABILITY. Infineon reserves the right to make changes to the Software
* without notice. You are responsible for properly designing, programming, and
* testing the functionality and safety of your intended application of the
* Software, as well as complying with any legal requirements related to its
* use. Infineon does not guarantee that the Software will be free from intrusion,
* data theft or loss, or other breaches ("Security Breaches"), and Infineon
* shall have no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any application
* where a failure of the Product or any consequences of the use thereof can
* reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "cy_result.h"
#include "secure_http_client.h"
#include "FreeRTOS.h"
#include "cyabs_rtos.h"
#include "cyabs_rtos_impl.h"
#include <task.h>
#include "retarget_io_init.h"
#include "cy_time.h"
#include "camera_capture.h"
// #include "ipc_communication.h"
// #include "ipc_pipe.h"
#include "shared_memory.h"

/*******************************************************************************
* Macros
*******************************************************************************/

/* RTOS related macros. */
#define HTTPS_CLIENT_TASK_STACK_SIZE        (10U * 1024U)
#define HTTPS_CLIENT_TASK_PRIORITY          (3U)
#define IPC_PIPE_INIT_TASK_STACK_SIZE       (10U * 1024U)
#define IPC_PIPE_INIT_TASK_PRIORITY          (2U)
#define CM55_BOOT_TASK_STACK_SIZE           (2048U)
#define CM55_BOOT_TASK_PRIORITY             (1U)
#define CM55_BOOT_DELAY_MS                  (8000U)

/* The timeout value in microseconds used to wait for the CM55 core to be booted */
#define CM55_BOOT_WAIT_TIME_US              (10U)

/* Enabling or disabling a MCWDT requires a wait time of upto 2 CLK_LF cycles
 * to come into effect. This wait time value will depend on the actual CLK_LF
 * frequency set by the BSP.
 */
#define LPTIMER_0_WAIT_TIME_USEC            (62U)

/* Define the LPTimer interrupt priority number. '1' implies highest priority.
 */
#define APP_LPTIMER_INTERRUPT_PRIORITY      (2U)

/* App boot address for CM55 project */
#define CM55_APP_BOOT_ADDR                (CYMEM_CM33_0_m55_nvm_START + \
                                           CYBSP_MCUBOOT_HEADER_SIZE)

/*******************************************************************************
* Global Variables
********************************************************************************/
static mtb_hal_lptimer_t lptimer_obj;

/* HTTPS client task handle. */
TaskHandle_t https_client_task_handle;
cy_rslt_t boot_http_task();
static cy_rslt_t boot_cm55_task(void);
static void cm55_boot_task(void *arg);

/* RTC HAL object */
static mtb_hal_rtc_t rtc_obj;

/*******************************************************************************
* Function Definitions
*******************************************************************************/
/*******************************************************************************
* Function Name: lptimer_interrupt_handler
********************************************************************************
* Summary:
* Interrupt handler function for LPTimer instance.
*******************************************************************************/
static void lptimer_interrupt_handler(void)
{
    mtb_hal_lptimer_process_interrupt(&lptimer_obj);
}

/*******************************************************************************
* Function Name: setup_tickless_idle_timer
********************************************************************************
* Summary:
* 1. This function first configures and initializes an interrupt for LPTimer.
* 2. Then it initializes the LPTimer HAL object to be used in the RTOS
*    tickless idle mode implementation to allow the device enter deep sleep
*    when idle task runs. LPTIMER_0 instance is configured for CM33 CPU.
* 3. It then passes the LPTimer object to abstraction RTOS library that
*    implements tickless idle mode.
*******************************************************************************/
static void setup_tickless_idle_timer(void)
{
    /* Interrupt configuration structure for LPTimer */
    cy_stc_sysint_t lptimer_intr_cfg =
    {
        .intrSrc = CYBSP_CM33_LPTIMER_0_IRQ,
        .intrPriority = APP_LPTIMER_INTERRUPT_PRIORITY
    };

    /* Initialize the LPTimer interrupt and specify the interrupt handler. */
    cy_en_sysint_status_t interrupt_init_status =
                                    Cy_SysInt_Init(&lptimer_intr_cfg,
                                                    lptimer_interrupt_handler);

    /* LPTimer interrupt initialization failed. Stop program execution. */
    if(CY_SYSINT_SUCCESS != interrupt_init_status)
    {
        handle_app_error();
    }

    /* Enable NVIC interrupt. */
    NVIC_EnableIRQ(lptimer_intr_cfg.intrSrc);

    /* Initialize the MCWDT block */
    cy_en_mcwdt_status_t mcwdt_init_status =
                                    Cy_MCWDT_Init(CYBSP_CM33_LPTIMER_0_HW,
                                                &CYBSP_CM33_LPTIMER_0_config);

    /* MCWDT initialization failed. Stop program execution. */
    if(CY_MCWDT_SUCCESS != mcwdt_init_status)
    {
        handle_app_error();
    }

    /* Enable MCWDT instance */
    Cy_MCWDT_Enable(CYBSP_CM33_LPTIMER_0_HW,
                    CY_MCWDT_CTR_Msk, LPTIMER_0_WAIT_TIME_USEC);

   /* Setup LPTimer using the HAL object and desired configuration as defined
    * in the device configurator.
    */
    cy_rslt_t result = mtb_hal_lptimer_setup(&lptimer_obj,
                                            &CYBSP_CM33_LPTIMER_0_hal_config);

    /* LPTimer setup failed. Stop program execution. */
    if(CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

   /* Pass the LPTimer object to abstraction RTOS library that implements
    * tickless idle mode
    */
    cyabs_rtos_set_lptimer(&lptimer_obj);
}

/*******************************************************************************
* Function Name: setup_clib_support
********************************************************************************
* Summary:
*    1. This function configures and initializes the Real-Time Clock (RTC).
*    2. It then initializes the RTC HAL object to enable CLIB support library
*       to work with the provided Real-Time Clock (RTC) module.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void setup_clib_support(void)
{
    /* RTC Initialization */
    Cy_RTC_Init(&CYBSP_RTC_config);
    Cy_RTC_SetDateAndTime(&CYBSP_RTC_config);

    /* Initialize the ModusToolbox CLIB support library */
    mtb_clib_support_init(&rtc_obj);
}


/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
*  Entry function for the application.
*  This function initializes the BSP and UART port for debugging. Then it
*  creates an "HTTPS Client" task and starts the RTOS scheduler.
*
* Parameters:
*  void
*
* Return:
*  int: Should never return.
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;

    /* Initialize the Board Support Package (BSP) */
    result = cybsp_init();

    /* Board init failed. Stop program execution */
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /* Setup CLIB support library. */
    setup_clib_support();

    /* Setup the LPTimer instance for CM33 CPU. */
    setup_tickless_idle_timer();

    /* Initialize retarget-io middleware */
    init_retarget_io();

    camera_capture_init();

	/* 初始化共享内存区域 */
	shared_mem_init();

    /* \x1b[2J\x1b[;H - ANSI ESC sequence to clear screen. */
    printf("\x1b[2J\x1b[;H");
    printf("===============================================================\n");
    printf("PSOC Edge MCU: HTTPS Client\n");
    printf("===============================================================\n\n");

    /* Enable global interrupts */
    __enable_irq();

	/* 初始化ipc_pipe */
	// ipc_pipe_init();

	// Cy_SysLib_Delay(CM33_APP_DELAY_MS);
    
    /* Starts the HTTPS Client in secure mode. */
	// result = xTaskCreate(ipc_pipe_init, "IPC Init", 
	// 			IPC_PIPE_INIT_TASK_STACK_SIZE, NULL, 
	// 			IPC_PIPE_INIT_TASK_PRIORITY, &ipc_pipe_task_handle);
	result = boot_http_task();
    if (pdPASS == result)
    {
        result = boot_cm55_task();
    }


    /* Start the FreeRTOS scheduler */
    if( pdPASS == result )
    {
        /* Start the RTOS Scheduler */
        vTaskStartScheduler();

    }

    /* Should never get here. */
    handle_app_error();

}

cy_rslt_t boot_http_task() {
	return xTaskCreate(https_client_task, "HTTPS Client",
                HTTPS_CLIENT_TASK_STACK_SIZE, NULL,
                HTTPS_CLIENT_TASK_PRIORITY, &https_client_task_handle);
}

static cy_rslt_t boot_cm55_task(void)
{
    return xTaskCreate(cm55_boot_task, "CM55 Boot",
                       CM55_BOOT_TASK_STACK_SIZE, NULL,
                       CM55_BOOT_TASK_PRIORITY, NULL);
}

static void cm55_boot_task(void *arg)
{
    (void)arg;

    printf("[CM55_BOOT] Delaying CM55 start for %lu ms\n",
           (unsigned long)CM55_BOOT_DELAY_MS);
    vTaskDelay(pdMS_TO_TICKS(CM55_BOOT_DELAY_MS));

    printf("[CM55_BOOT] Enabling CM55\n");
    Cy_SysEnableCM55(MXCM55, CM55_APP_BOOT_ADDR, CM55_BOOT_WAIT_TIME_US);
    printf("[CM55_BOOT] CM55 enable requested\n");

    vTaskDelete(NULL);
}
/* [] END OF FILE */
